{
  "common": {
    "or": "or",
    "appName": "Handbook of Chemistry"
  },
  "homepage": {
    "aboutTitle": "About",
    "aboutText": "<mainBody>Chemistry is a fascinating subject, but not all students can easily understand it. Therefore, our team of developers decided to create an online workbook that includes brief reference material on the required topics. The workbook consists of two sections for 10th and 11th grade material: organic and inorganic chemistry. In these sections, you can find both reference material (substances, their structural formulas, properties, applications, methods of production, and even ball-and-stick models) and problems on various topics.</mainBody><subText>We hope you will find it interesting to explore chemistry with our workbook, so we wish you good luck!</subText>"
  },
  "navigation": {
    "title": "Chemistry",
    "languages": {
      "en": "English",
      "ru": "Russian"
    },
    "organic": {
      "title": "Organic Chemistry"
    },
    "alkanes": {
      "title": "Alkanes",
      "handbook": "Alkanes Handbook",
      "tasks": "Alkanes Tasks"
    },
    "cycloalkanes": {
      "title": "Cycloalkanes",
      "handbook": "Cycloalkanes Handbook",
      "tasks": "Cycloalkanes Tasks"
    },
    "alkenes": {
      "title": "Alkenes",
      "handbook": "Alkenes Handbook",
      "tasks": "Alkenes Tasks"
    },
    "alkynes": {
      "title": "Alkynes",
      "handbook": "Alkynes Handbook",
      "tasks": "Alkynes Tasks"
    },
    "arenes": {
      "title": "Arenes",
      "handbook": "Arenes Handbook",
      "tasks": "Arenes Tasks"
    },
    "alcohols": {
      "title": "Alcohols",
      "handbook": "Alcohols Handbook",
      "tasks": "Alcohols Tasks"
    },
    "phenols": {
      "title": "Phenols",
      "handbook": "Phenols Handbook",
      "tasks": "Phenols Tasks"
    },
    "aldehydes_ketones": {
      "title": "Aldehydes and Ketones",
      "handbook": "Aldehydes and Ketones Handbook",
      "tasks": "Aldehydes and Ketones Tasks"
    },
    "carboxylicAcids": {
      "title": "Carboxylic Acids",
      "handbook": "Carboxylic Acids Handbook",
      "tasks": "Carboxylic Acids Tasks"
    },
    "esters": {
      "title": "Esters",
      "handbook": "Esters Handbook",
      "tasks": "Esters Tasks"
    },
    "carbohydrates": {
      "title": "Carbohydrates",
      "handbook": "Carbohydrates Handbook",
      "tasks": "Carbohydrates Tasks"
    },
    "amines": {
      "title": "Amines",
      "handbook": "Amines Handbook",
      "tasks": "Amines Tasks"
    },
    "amino_acids": {
      "title": "Amino Acids",
      "handbook": "Amino Acids Handbook",
      "tasks": "Amino Acids Tasks"
    },
    "inorganic": {
      "title": "Inorganic Chemistry"
    },
    "alkali_metals": {
      "title": "Alkali Metals",
      "handbook": "Alkali Metals Handbook",
      "tasks": "Alkali Metals Tasks"
    },
    "alkaline_earth_metals": {
      "title": "Alkaline Earth Metals",
      "handbook": "Alkaline Earth Metals Handbook",
      "tasks": "Alkaline Earth Metals Tasks"
    },
    "transition_metals": {
      "title": "Transition Metals",
      "handbook": "Transition Metals Handbook",
      "tasks": "Transition Metals Tasks"
    },
    "metalloids": {
      "title": "Metalloids",
      "handbook": "Metalloids Handbook",
      "tasks": "Metalloids Tasks"
    },
    "nonmetals": {
      "title": "Nonmetals",
      "handbook": "Nonmetals Handbook",
      "tasks": "Nonmetals Tasks"
    },
    "halogens": {
      "title": "Halogens",
      "handbook": "Halogens Handbook",
      "tasks": "Halogens Tasks"
    },
    "noble_gases": {
      "title": "Noble Gases",
      "handbook": "Noble Gases Handbook",
      "tasks": "Noble Gases Tasks"
    }
  },
  "guide": {
    "definitionTitle": "Definition:",
    "empiricalFormula": "Empirical Formula:",
    "structureFormula": "Structure Formula:",
    "structureFormulas": "Examples of Structure Formulas:",
    "isomerism": "Isomerism:",
    "isomerismSeeAlkanes": "Branching of the carbon skeleton (see Alkanes)",
    "branchingCarbonSkeleton": "Branching of the Carbon Skeleton:",
    "physicalProperties": "Physical Properties:",
    "production": "Production:",
    "applications": "Applications:",
    "chemicalProperties": "Pic. Chemical Properties.",
    "alkanes": {
      "definitionText": "Alkanes are organic acyclic compounds that consist of hydrogen and carbon atoms, where all of the carbon–carbon bonds are single.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "physicalProperties": "First 3 alkanes are gases. Alkanes starting from pentane are liquids. Alkanes starting from C16 are solids. Alkanes are insoluble in water. Alkanes are soluble in organic solvents. Unbranched alkanes have higher boiling points than branched alkanes.",
      "isomerism": {
        "1": "Branching of the Carbon Skeleton:"
      },
      "production": {
        "1": "Hydrogenation of unsaturated hydrocarbons. (t, catalysts: Ni, Pt, Pd):",
        "2": "Based on synthesis gas:"
      },
      "applications": {
        "freons": "Freons",
        "solvents": "Solvents",
        "SynthesisGas": "Synthesis gas",
        "sootRubber": "Soot,rubber",
        "detergents": "Detergents",
        "fuel": "Fuel"
      },
      "model": "Model. Pentane."
    },
    "cycloalkanes": {
      "definitionText": "Cycloalkanes are organic compounds that consist of hydrogen and carbon atoms, where all of the carbon–carbon bonds are single, and the molecule is cyclic.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "physicalProperties": "Cycloalkanes are gases. Cycloalkanes are insoluble in water. Cycloalkanes are soluble in organic solvents. The boiling points of cycloalkanes increase with the number of carbon atoms in the ring.",
      "production": "Hydrogenation of alkenes. (t, catalysts: Ni, Pt, Pd):",
      "applications": {
        "solvents": "Solvents",
        "fuel": "Fuel"
      },
      "model": "Model. Cyclopentane."
    },
    "alkenes": {
      "definitionText": "Alkenes are organic compounds that consist of hydrogen and carbon atoms, where at least one carbon–carbon double bond is present.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "isomerism": "Branching of the carbon skeleton (see Alkanes)",
      "physicalProperties": "First 3 alkenes are gases. Alkenes starting from pentene are liquids. Alkenes starting from C18 are solids. Alkenes are slightly soluble in water. Boiling points of unbranched alkenes and cis-isomers are higher, against branched and trans-isomers.",
      "production": {
        "1": "Dehydrogenation of alkanes, cracking:",
        "2": "Hydrogenation of alkynes, alkadienes:"
      },
      "applications": {
        "explosives": "Explosives",
        "plastics": "Plastics",
        "medicine": "Medicine",
        "photoreagents": "Photoreagents",
        "dyes": "Dyes"
      },
      "model": "Model. Pentene-1."
    },
    "alkynes": {
      "definitionText": "Alkynes are organic compounds that consist of hydrogen and carbon atoms, where at least one carbon–carbon triple bond is present.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "isomerism": "Branching of the carbon skeleton (see Alkanes)",
      "physicalProperties": " Like alkenes, the first three alkynes are gases, from C5 to C15 - liquids, from C16 - solids. Slightly soluble in water, density below water. The boiling and melting points of alkynes are higher than those of corresponding alkenes(especially for the first three). Unbranched alkynes have higher boiling points than branched ones.",
      "production": {
        "1": "Dehydrogenation of hydrocarbons (thermal decomposition, cracking):",
        "2": "Decomposition of calcium carbide with water or acid solution:"
      },
      "applications": {
        "chloroprene": "Chloroprene",
        "isoprene": "Isoprene",
        "acetaldehyde": "Acetaldehyde",
        "metalCuttingWelding": "Metal cutting, welding",
        "arenes": "Arenes"
      },
      "model": "Model. Pentyne-1."
    },
    "arenes": {
      "definitionText": "Arenes are cyclic organic compounds consisting of carbon and hydrogen atoms and having one or more benzene rings in the molecule.",
      "definitionCredits": "S.A. Litvinova, N.V. Mankevich \"Organic Chemistry in Tables\"",
      "physicalProperties": "Most aromatic hydrocarbons are liquids with a characteristic odor, insoluble in water but soluble in organic solvents. They are all lighter than water. Boiling points increase in the homologous series.",
      "model": ""
    },
    "alcohols": {
      "definitionText": "Alcohols are organic compounds that contain an alcohol functional group, consisting of a hydroxyl group bonded to a carbon atom.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "isomerism": {
        "1": "Branching of the Carbon Skeleton:",
        "2": "Functional group displacement:",
        "3": "Interspecies isomerism:",
        "4": "Stereoisomerism:"
      },
      "physicalProperties": "Lower alcohols are liquids, higher alcohols are solids. The compounds are volatile because hydrogen bonds are weak. The boiling point is higher than that of the corresponding hydrocarbons. They dissolve in water, hydrogen bonds form between the molecules of alcohols and water.",
      "production": {
        "1": "From alkenes:",
        "2": "From halogen derivatives:",
        "3": "From aldehydes:",
        "4": "From ketones:",
        "5": "From glucose:"
      },
      "applications": {
        "foodIndustry": "Food industry",
        "perfumeryCosmeticsHouseholdChemicals": "Perfumery, cosmetics and household chemicals",
        "medicine": "Medicine",
        "fuel": "Fuel",
        "chemicalReagent": "Chemical Reagent"
      },
      "model": "Model. Ethanol."
    },
    "phenols": {
      "definitionText": "Phenols are hydroxyl derivatives of benzene. They can contain one or several hydroxyl groups in the benzene ring.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "physicalProperties": "Phenol is a colorless crystalline substance with a characteristic odor. It turns pink when exposed to air. It is poorly soluble in water, but becomes completely soluble when the temperature is raised to 70°C (158°F). It is highly toxic!",
      "model": ""
    },
    "aldehydes_ketones": {
      "definitionText": "Aldehydes and ketones are organic compounds that contain a carbonyl functional group, consisting of a carbon atom double-bonded to an oxygen atom.",
      "definitionCredits": "",
      "physicalProperties": "First 3 alkanes are gases. Alkanes starting from pentane are liquids. Alkanes starting from C16 are solids. Alkanes are insoluble in water. Alkanes are soluble in organic solvents. Unbranched alkanes have higher boiling points than branched alkanes.",
      "model": "Model: Formaldehyde."
    },
    "carboxylicAcids": {
      "definitionText": "Carboxylic acids are a class of organic compounds whose molecules contain one or more functional carboxyl groups - COOH.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "isomerism": {
        "1": "Branching of the carbon chain",
        "2": "Intergroup isomerism (complex esters)"
      },
      "physicalProperties": "Saturated straight-chain carboxylic acids containing 1 to 9 carbon atoms, as well as branched ones up to 13 carbon atoms, are liquids, and starting from butyric acid (C4H8O2), they become viscous liquids. Acids containing 1 to 3 carbon atoms have a sharp odor and are miscible with water in any proportions. As the chain grows, their solubility in water decreases. Higher carboxylic acids containing 10 or more carbon atoms are solid substances with no odor and are insoluble in water. Aromatic and dibasic acids are colorless crystalline substances that are readily soluble in water. Their solubility in water, like that of other acids, decreases with increasing carbon chain length.",
      "production": {
        "1": "Oxidation of aldehydes",
        "2": "Oxidation of alcohols",
        "3": "Hydrolysis of complex esters",
        "4": "Interaction of carboxylic acid salts with mineral acids"
      },
      "applications": {
        "textileIndustry": "Textile industry",
        "pharmaceuticalIndustry": "Pharmaceutical industry",
        "solvents": "Solvents",
        "plastics": "Plastics",
        "catalysts": "Catalysts",
        "dyes": "Dyes",
        "pesticides": "Pesticides"
      },
      "model": "Model. Formic Acid."
    },
    "esters": {
      "definitionText": "Esters are derivatives of acids (both organic and inorganic), where the hydrogen atom in the COOH carboxyl group is replaced by a hydrocarbon radical.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "isomerism": {
        "1": "Branching of the Carbon Skeleton",
        "2": "Isomerism of the position of the –CO-O- group",
        "3": "Interspecies isomerism"
      },
      "physicalProperties": "Esters of lower carboxylic acids and simple monohydric alcohols are colorless volatile liquids with a characteristic fruity odor. Esters of higher carboxylic acids are colorless solids, insoluble in water. They have a lower boiling point than the corresponding acids.",
      "production": {
        "1": "The main reaction is the esterification reaction"
      },
      "applications": {
        "metalworking": "Metalworking",
        "lubricants": "Used as lubricants in the form of natural fats",
        "plasticizers": "Plasticizers to lower temperature",
        "synthesis": "Used in the synthesis of tertiary alcohols"
      },
      "model": "Model. Ethyl ethanoate."
    },
    "carbohydrates": {
      "definitionText": "Carbohydrates are oxygen-containing organic compounds that contain a carbonyl group and hydroxyl groups (or only hydroxyl groups) in their composition.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "physicalProperties": "First 3 alkanes are gases. Alkanes starting from pentane are liquids. Alkanes starting from C16 are solids. Alkanes are insoluble in water. Alkanes are soluble in organic solvents. Unbranched alkanes have higher boiling points than branched alkanes.",
      "model": ""
    },
    "amines": {
      "definitionText": "Amines are organic compounds that are derivatives of ammonia, in which one, two, or three hydrogen atoms are replaced by hydrocarbon radicals.",
      "definitionCredits": "S.A. Litvinova, N.V. Mankevich \"Organic Chemistry in Tables\"",
      "physicalProperties": "Amines such as methylamine, ethylamine, dimethylamine, and trimethylamine are gases at room temperature with an unpleasant fishy smell. Starting from propylamine and above, they are liquids. Higher amines (C>10) are solid substances, almost odorless. Lower amines dissolve well in water, with ethylamine and butylamine being infinitely soluble. Higher amines do not dissolve in water. Due to intermolecular hydrogen bonds, amines have high boiling and melting points.",
      "model": ""
    },
    "amino_acids": {
      "definitionText": "Amino acids are organic compounds that contain one or more carboxyl groups and one or more amino groups, linked to hydrocarbon groups.",
      "definitionCredits": "S.A. Litvinova and N.V. Mankevich, \"Organic Chemistry via Tables\"",
      "physicalProperties": "Amino acids are colorless crystalline substances that are highly soluble in water. Amino acids of the D-series have a sweet taste. This characteristic is not typical for the L-series. The melting points of amino acids are relatively high. For glycine homologs, the melting points increase with the number of carbon atoms in the molecules.",
      "model": ""
    }
  },
  "tasks": {
    "alkanes": {
      "level1": {
        "1": {
          "text": "When 0.144 g of a saturated hydrocarbon is burned, 0.44 g of carbon dioxide is produced. Determine the formula of the hydrocarbon."
        },
        "2": {
          "text": "Determine the saturated hydrocarbon in which the carbon content is 82.76% by mass."
        },
        "3": {
          "text": "Establish the molecular formula of a dibromoalkane containing 79.21% bromine."
        },
        "4": {
          "text": "Determine the formula of a saturated hydrocarbon. If it is known that 8.6 g of it produced 13.44 L of carbon dioxide during complete combustion."
        },
        "5": {
          "text": "To burn a certain alkane, 8 times the volume of oxygen is required compared to the volume of the hydrocarbon vapor under the same conditions. Determine the formula of the alkane."
        },
        "6": {
          "text": "When 7 g of a cycloalkane is burned, 22 g of carbon oxide (IV) is produced. What volume of oxygen, measured at standard conditions, is consumed in this process?"
        },
        "7": {
          "text": "When 28.8 g of the sodium salt of a saturated monocarboxylic acid is melted with excess sodium hydroxide, 4.63 L of gas (at standard conditions) is released, which is 79% of the theoretical yield. Determine the molecular formula of the gas released."
        },
        "8": {
          "text": "How many liters of air are required for the complete combustion of 6 L of a mixture of propane and butane containing 40% butane?"
        },
        "9": {
          "text": "Natural gas from one deposit consists of 85% methane, 8% ethane, 2% nitrogen, and 3% carbon dioxide. Determine the volume of air needed to burn 2 m³ of this gas."
        },
        "10": {
          "text": "During the chlorination of 112 cm³ of a gaseous hydrocarbon (at standard conditions), 0.73 g of hydrogen chloride is obtained. How many chlorine atoms have been replaced by chlorine in the hydrocarbon?"
        },
        "11": {
          "text": "When 2016 mL (at standard conditions) of methane are chlorinated, 0.1 moles of chlorine are consumed. Determine the amount (in moles) of the resulting substances."
        },
        "12": {
          "text": "During the chlorination of 17.92 L (at standard conditions) of methane, 109.4 g of a mixture of trichloromethane and tetrachloromethane is obtained. Find the mass percentages of the chlorination products of methane in their mixture."
        },
        "13": {
          "text": "Upon heating 49 g of a mixture consisting of potassium acetate and excess potassium hydroxide, a gas is released that reacts with bromine vapor when illuminated. As a result, 25.3 g of tribromomethane is obtained with a 50% yield. Determine the mass fractions of substances in the initial mixture."
        },
        "14": {
          "text": "How much chloroform (1.5 g/mL) can be obtained from 160 L of natural gas (at standard conditions) containing 92% methane? The yield of chloroform is 76% of the theoretical."
        },
        "15": {
          "text": "From 50 L of natural gas (at standard conditions), 40.4 g of methyl chloride is obtained. Calculate the volumetric percentage of methane in the natural gas, if the mass fraction of methyl chloride yield is 44%."
        },
        "16": {
          "text": "Natural gas with a volume of 240 L (at standard conditions) was used to produce acetylene. The volumetric fraction of methane in the gas is 85%. Determine the volume of acetylene (at standard conditions) produced if the yield is 60%."
        },
        "17": {
          "text": "From 40 L of natural gas (at standard conditions), 30.3 g of chloromethane is obtained. Determine the volumetric fraction of methane in the natural gas, if the yield of chloromethane is 60%."
        },
        "18": {
          "text": "When iodomethane with a mass of 2.84 g is heated with metallic sodium with a mass of 0.69 g, ethane is produced, the volume of which at normal conditions is 179.2 mL. Determine the product yield."
        },
        "19": {
          "text": "A sample of technical aluminum carbide with a mass of 16 g is treated with excess water. Determine the volume of gas produced in this process, if the mass fraction of impurities in the carbide is 10%, and the yield of the reaction product is 75%. Calculate the volume of gas at standard conditions."
        }
      },
      "level2": {
        "1": {
          "text": "To burn a portion of an alkane containing 1∙10^23 molecules, a portion of oxygen containing 1.6∙10^24 atoms is required. Determine the composition and possible structure.",
          "answer": "C5H12"
        },
        "2": {
          "text": "The sodium salt of a monocarboxylic acid with a mass of 84 g was heated with excess caustic soda, and the reaction proceeded with a yield of 75%. To burn the resulting hydrocarbon, 14.7 L (at standard conditions) of oxygen was required. Determine the formula of the original salt.",
          "answer": "CH3CH2COONa"
        },
        "3": {
          "text": "56 mL of gaseous hydrocarbon were mixed with 672 mL of oxygen and burned. When the combustion products were passed through a solution of barium hydroxide, 1.97 g of precipitate was obtained. Determine the formula of the original hydrocarbon.",
          "answer": "C4H10"
        },
        "4": {
          "text": "A gaseous alkane with a volume of 224 mL (at standard conditions) was burned, and the reaction products were passed through 1 L of lime water containing 0.148% calcium hydroxide (1 g/mL). Some of the initially formed precipitate dissolved. The mass of the undissolved residue was 1.00 g. What is the formula of the alkane?",
          "answer": "C3H8"
        },
        "5": {
          "text": "A mixture of 5 mL of gaseous hydrocarbon and 20 mL of oxygen was exploded. After the reaction, the volume of the gas mixture was 12.5 mL, and after passing it through a solution of alkali, the volume decreased to 2.5 mL, with the remaining gas supporting combustion. Determine the formula of the hydrocarbon.",
          "answer": "C2H6"
        },
        "6": {
          "text": "Determine the formula of an alkane if, during the complete absorption of the combustion products of 8.6 g of the alkane by a solution of sodium hydroxide, 21.2 g of sodium carbonate and 33.6 g of sodium hydrogencarbonate were obtained.",
          "answer": "C6H14"
        },
        "7": {
          "text": "A mixture of propane, methane, and carbon dioxide (IV) occupies a volume of 6.165 L. After burning the mixture in excess oxygen, 11.565 L of carbon dioxide was obtained. Determine the propane content in the original mixture (in % by volume).",
          "answer": "43,8%"
        },
        "8": {
          "text": "To 165 L of a mixture of methane, hydrogen, and nitrogen, 270 mL of oxygen was added, and the mixture was ignited. After the reaction, the volume of the mixture was 156 L. When the reaction products were passed through excess alkali solution, the volume decreased to 48 L. Assuming that all volumes are measured at standard conditions, determine the volumes of gases in the original mixture.",
          "answer": "108 L CH4; 42 L H2; 15 L N2"
        },
        "9": {
          "text": "All the carbon dioxide obtained from 2.24 L of ethane was passed through 38.2 mL of a 32% potassium hydroxide solution (1.31 g/mL). Determine the mass fractions of substances in the resulting solution.",
          "answer": "20,18% K2CO3; 19,39% KHCO3"
        },
        "10": {
          "text": "During the bromination of 5.6 L of methane, a mixture of bromomethane and dibromomethane, as well as hydrogen bromide, was obtained and dissolved in 300 mL of water. A solution with a concentration of 9.75% was formed. Determine the mass fraction of dibromomethane in the resulting mixture.",
          "answer": "73,3%"
        },
        "11": {
          "text": "Excess metallic sodium was reacted with a mixture of 38 g of bromomethane and 21.8 g of bromoethane, resulting in a mixture of ethane, propane, and butane with a volume of 6.72 L (at standard conditions). Determine the volumetric fraction of ethane in the resulting mixture, assuming the volumetric fraction of propane is 33.33%.",
          "answer": "50%"
        },
        "12": {
          "text": "A mixture of propane, methane, and carbon dioxide (IV) occupies a volume of 6.165 L. After burning the mixture in excess oxygen, 11.565 L of CO2 is obtained. Determine the propane content in the mixture (in % by volume).",
          "answer": "43,8%"
        },
        "13": {
          "text": "To a certain volume of alkane, ten times the volume of a nitrogen and oxygen mixture with a density at standard conditions of 1.357 g/L was added. The mixture was then explosively ignited in a closed container. The volumetric fraction of nitrogen in the resulting gas mixture after being brought to standard conditions was 50%. Determine which alkane was oxidized.",
          "answer": "propane"
        },
        "14": {
          "text": "A mixture of an alkane and oxygen, with a stoichiometric volume ratio, after combustion, condensation of water vapor, and returning to the initial conditions, decreased in volume by a factor of 1.8. Determine the structure of the alkane that was part of the mixture, knowing that there is one quaternary carbon atom in its molecule.",
          "answer": "dimethylpropane"
        },
        "15": {
          "text": "There is a mixture of branched-chain alkanes. Its vapor density compared to air is 2.193. During chlorination of this mixture, only two pairs of isomeric chloroproducts were obtained, and hydrochloric acid was dissolved in 300 mL of water. A solution with a concentration of 9.75% was formed. Calculate the mass fractions of alkanes in the original mixture.",
          "answer": "73,1% C4H10; 26,9% C6H10"
        }
      }
    },
    "cycloalkanes": {
      "level1": {},
      "level2": {}
    },
    "alkenes": {
      "level1": {},
      "level2": {}
    },
    "alkynes": {
      "level1": {},
      "level2": {}
    },
    "arenes": {
      "level1": {},
      "level2": {}
    },
    "alcohols": {
      "level1": {},
      "level2": {}
    },
    "phenols": {
      "level1": {},
      "level2": {}
    },
    "aldehydes_ketones": {
      "level1": {},
      "level2": {}
    },
    "carboxylicAcids": {
      "level1": {},
      "level2": {}
    },
    "esters": {
      "level1": {},
      "level2": {}
    },
    "carbohydrates": {
      "level1": {},
      "level2": {}
    },
    "amines": {
      "level1": {},
      "level2": {}
    },
    "amino_acids": {
      "level1": {},
      "level2": {}
    }
  }
}